In [27]:
import pandas as pd

data={
    'name':['bibin','shri','srujan'],
    'mark':[80,99,95]
}

In [28]:
df=pd.DataFrame(data)
print(df)

     name  mark
0   bibin    80
1    shri    99
2  srujan    95

In [29]:
s=pd.Series(data)
print(s)

name    [bibin, shri, srujan]
mark             [80, 99, 95]
dtype: object

In [30]:
print(s[0])

['bibin', 'shri', 'srujan']

In [31]:
df.index=['s1','s2','s3']
print(df)

      name  mark
s1   bibin    80
s2    shri    99
s3  srujan    95

In [32]:
print(df.iloc[0])

name    bibin
mark       80
Name: s1, dtype: object

In [33]:
print(df.loc['s1'])

name    bibin
mark       80
Name: s1, dtype: object

In [34]:
print(df.loc[(df.mark>90)])

      name  mark
s2    shri    99
s3  srujan    95

In [35]:

df2=pd.read_csv('..\..\..\..\..\Downloads\industry.csv')
df2

                         Industry
0              Accounting/Finance
1    Advertising/Public Relations
2              Aerospace/Aviation
3   Arts/Entertainment/Publishing
4                      Automotive
5                Banking/Mortgage
6            Business Development
7            Business Opportunity
8         Clerical/Administrative
9         Construction/Facilities
10                 Consumer Goods
11               Customer Service
12             Education/Training
13               Energy/Utilities
14                    Engineering
15            Government/Military
16                          Green
17                     Healthcare
18             Hospitality/Travel
19                Human Resources
20       Installation/Maintenance
21                      Insurance
22                       Internet
23                Job Search Aids
24       Law Enforcement/Security
25                          Legal
26           Management/Executive
27       Manufacturing/Operations
28                      Marketing
29           Non-Profit/Volunteer
30         Pharmaceutical/Biotech
31          Professional Services
32             QA/Quality Control
33                    Real Estate
34        Restaurant/Food Service
35                         Retail
36                          Sales
37               Science/Research
38                  Skilled Labor
39                     Technology
40             Telecommunications
41       Transportation/Logistics
42                          Other

In [36]:
df2.to_string()

'                         Industry\n0              Accounting/Finance\n1    Advertising/Public Relations\n2              Aerospace/Aviation\n3   Arts/Entertainment/Publishing\n4                      Automotive\n5                Banking/Mortgage\n6            Business Development\n7            Business Opportunity\n8         Clerical/Administrative\n9         Construction/Facilities\n10                 Consumer Goods\n11               Customer Service\n12             Education/Training\n13               Energy/Utilities\n14                    Engineering\n15            Government/Military\n16                          Green\n17                     Healthcare\n18             Hospitality/Travel\n19                Human Resources\n20       Installation/Maintenance\n21                      Insurance\n22                       Internet\n23                Job Search Aids\n24       Law Enforcement/Security\n25                          Legal\n26           Management/Executive\n27       Manufacturing/Operations\n28                      Marketing\n29           Non-Profit/Volunteer\n30         Pharmaceutical/Biotech\n31          Professional Services\n32             QA/Quality Control\n33                    Real Estate\n34        Restaurant/Food Service\n35                         Retail\n36                          Sales\n37               Science/Research\n38                  Skilled Labor\n39                     Technology\n40             Telecommunications\n41       Transportation/Logistics\n42                          Other'

In [38]:
pd.options.display.max_rows = 10 #by default 60
df2

                         Industry
0              Accounting/Finance
1    Advertising/Public Relations
2              Aerospace/Aviation
3   Arts/Entertainment/Publishing
4                      Automotive
..                            ...
38                  Skilled Labor
39                     Technology
40             Telecommunications
41       Transportation/Logistics
42                          Other

[43 rows x 1 columns]

In [39]:
df2.head()

                        Industry
0             Accounting/Finance
1   Advertising/Public Relations
2             Aerospace/Aviation
3  Arts/Entertainment/Publishing
4                     Automotive

In [41]:
df2.tail(10)

                    Industry
33               Real Estate
34   Restaurant/Food Service
35                    Retail
36                     Sales
37          Science/Research
38             Skilled Labor
39                Technology
40        Telecommunications
41  Transportation/Logistics
42                     Other

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, s1 to s3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   mark    3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [43]:
df2.count()

Industry    43
dtype: int64

In [44]:
newdf2=df2.dropna()
newdf2

                         Industry
0              Accounting/Finance
1    Advertising/Public Relations
2              Aerospace/Aviation
3   Arts/Entertainment/Publishing
4                      Automotive
..                            ...
38                  Skilled Labor
39                     Technology
40             Telecommunications
41       Transportation/Logistics
42                          Other

[43 rows x 1 columns]

In [45]:
df2.dropna(inplace=True)

In [ ]:
df2.fillna('something',inplace=True)